app/Controllers/Home.php

SELECT *
FROM `livros`
---
    public function livros()
    {
        $meuarray = $this->session->get();
        if (isset($meuarray['nome'])) {
            $livrosModel = new livrosModel();
            $resultado = $livrosModel->findAll();

SELECT *
FROM `usuarios`
WHERE `email` = 'g@g'
 LIMIT 1
---
    public function loginVerify()
    {
        $login = $this->request->getVar('email');
        $senha = $this->request->getVar('senha');

        $usuariosModel = new UsuariosModel();
        $resultado = $usuariosModel->where('email', $login)->first();

SELECT *
FROM `livros`
WHERE `titulo` LIKE '%2016%' ESCAPE '!'
SELECT *
FROM `livros`
WHERE `ano` LIKE '%2016%' ESCAPE '!'
SELECT *
FROM `livros`
WHERE `autor` LIKE '%2016%' ESCAPE '!'
---
    public function pesquisar()
    {
        $search = $this->request->getVar('pesquisar');
        $db = \Config\Database::connect();
        $builder = $db->table('livros');
        $resultado = $builder->like('titulo', $search)->get()->getResult('array');
        $resultadoAno = $builder->like('ano', $search)->get()->getResult('array');
        $resultadoAutor = $builder->like('autor', $search)->get()->getResult('array');